_tmp_calender = {
	weekend =  -- 2 ngµy cuèi tuÇn, ®Êu 8 trËn, tõ 18h~19h ®Õn 19~20h
	{
		{18*60, 4},	
		{19*60, 4},
	},
	common = -- c¸c ngµy ®Çu tuÇn tõ thø 2 ®Õn thø 6
	{	
		-- {19*60, 4}, 
		{18*60, 4}, 
		
		
		-------------------------------------------------------------------
		-- {16*60, 4}, 
		-- {17*60, 4},	
		-------------------------------------------------------------------
	}
}
--Èü¼¾°²ÅÅ
-- ÀàÐÍ£º1¡¢Ë«ÈË£»2¡¢ÃÅÅÉ£»3¡¢Ê¦Í½£»4¡¢ÈýÈË£»5¡¢»ìºÏµ¥ÈË£»6¡¢Í¬ÏµË«ÈË£»7¡¢»ìºÏË«ÈË
WLLS_SEASON_TB = {
	--[ID]={ÀàÐÍ, 	¿ªÊ¼ÈÕÆÚ,	½áÊøÈÕÆÚ,	²ÎÈü´ÎÊý,	ÈÕ³Ì°²ÅÅ}
	[0] = {2,		0,			0,			0,			{}},	--¿ÕÈü¼¾£¬¼«¶ËÇé¿ö±£»¤
	--[ID]={the loai(1=>7), 	ngay bat dau,	ngay ket thuc,	so tran toi da,	the lich}
	-- 1=  Song ®Êu tù do
	-- 2=  ®¬n ®Êu m«n ph¸i
	-- 3=  song ®Êu s­ ®å
	-- 4=  tam ®Êu tù do
	-- 5= ®¬n ®Êu tù do
	-- 6= song ®Êu cïng hÖ = sau nay bi loai bo
	-- 7= song ®Êu nam nö = sau nay bi loai bo
	-- n¨m 2026 - full th¸ng
	[40] = {5,		260101,		260128,		64,		_tmp_calender},
	[41] = {5,		260201,		260228,		64,		_tmp_calender},
	[42] = {5,		260301,		260328,		64,		_tmp_calender},
	[43] = {5,		260401,		260428,		64,		_tmp_calender},
	[44] = {5,		260501,		260528,		64,		_tmp_calender},
	[45] = {5,		260601,		260628,		64,		_tmp_calender},
	[46] = {5,		260701,		260728,		64,		_tmp_calender},
	[47] = {5,		260801,		260828,		64,		_tmp_calender},
	[48] = {5,		260901,		260928,		64,		_tmp_calender},
	[49] = {5,		261001,		261028,		64,		_tmp_calender},
	[50] = {5,		261101,		261128,		64,		_tmp_calender},
	[51] = {5,		261201,		261228,		64,		_tmp_calender},
	
	-- 15ÄêÁªÈü 2027 - full th¸ng
	[52] = {5,		270101,		270128,		64,		_tmp_calender},
	[53] = {5,		270201,		270228,		64,		_tmp_calender},
	[54] = {5,		270301,		270328,		64,		_tmp_calender},
	[55] = {5,		270401,		270428,		64,		_tmp_calender},
	[56] = {5,		270501,		270528,		64,		_tmp_calender},
	[57] = {5,		270601,		270628,		64,		_tmp_calender},
	[58] = {5,		270701,		270728,		64,		_tmp_calender},
	[59] = {5,		270801,		270828,		64,		_tmp_calender},
	[60] = {5,		270901,		270928,		64,		_tmp_calender},
	[61] = {5,		271001,		271028,		64,		_tmp_calender},
	[62] = {5,		271101,		271128,		64,		_tmp_calender},
	[63] = {5,		271201,		271228,		64,		_tmp_calender},
	
	-- Update lÞch cho n¨m 2028
	[64] = {5,		280101,		280128,		64,		_tmp_calender},
	[65] = {5,		280201,		280228,		64,		_tmp_calender},
	[66] = {5,		280301,		280328,		64,		_tmp_calender},
	[67] = {5,		280401,		280428,		64,		_tmp_calender},
	[68] = {5,		280501,		280528,		64,		_tmp_calender},
	[69] = {5,		280601,		280628,		64,		_tmp_calender},
	[70] = {5,		280701,		280728,		64,		_tmp_calender},
	[71] = {5,		280801,		280828,		64,		_tmp_calender},
	[72] = {5,		280901,		280928,		64,		_tmp_calender},
	[73] = {5,		281001,		281028,		64,		_tmp_calender},
	[74] = {5,		281101,		281128,		64,		_tmp_calender},
	[75] = {5,		281201,		281228,		64,		_tmp_calender},
	
	-- Update lÞch cho n¨m 2029
	[76] = {5,		290101,		290128,		64,		_tmp_calender},
	[77] = {5,		290201,		290228,		64,		_tmp_calender},
	[78] = {5,		290301,		290328,		64,		_tmp_calender},
	[79] = {5,		290401,		290428,		64,		_tmp_calender},
	[80] = {5,		290501,		290528,		64,		_tmp_calender},
	[81] = {5,		290601,		290628,		64,		_tmp_calender},
	[82] = {5,		290701,		290728,		64,		_tmp_calender},
	[83] = {5,		290801,		290828,		64,		_tmp_calender},
	[84] = {5,		290901,		290928,		64,		_tmp_calender},
	[85] = {5,		291001,		291028,		64,		_tmp_calender},
	[86] = {5,		291101,		291128,		64,		_tmp_calender},
	[87] = {5,		291201,		291228,		64,		_tmp_calender},
}
--½áÎ²Á½¸ö¿ÕÈü¼¾±ÜÃâ¼«¶ËÇé¿ö
WLLS_SEASON_TB[getn(WLLS_SEASON_TB)+1] = {2,	999998,	999998,	0,	_tmp_calender}
WLLS_SEASON_TB[getn(WLLS_SEASON_TB)+1] = {2,	999999,	999999,	0,	_tmp_calender}
